{
  "backend/main.mo": "Defines marketplace types and actor logic for users, categories, entrepreneur profiles, products, and inquiries with access control.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to related source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all frontend files for documentation or tooling use.",
  "frontend/index.css": "Tailwind base styles and custom OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with theme provider and layout.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling Internet Identity login/logout and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal form for first‑time users to enter and save their profile information.",
  "frontend/src/components/dashboard/InquiriesPanel.tsx": "Displays entrepreneur inquiries with loading skeletons and empty states.",
  "frontend/src/components/dashboard/ProductEditor.tsx": "Modal form for creating or editing a product, handling input state, validation, and submission via mutation hooks.",
  "frontend/src/components/dashboard/ProductListManager.tsx": "Displays a grid of product cards and opens the ProductEditor to add or edit product listings.",
  "frontend/src/components/dashboard/SellerProfileForm.tsx": "Form for creating or updating a seller's business profile with validation and category selection.",
  "frontend/src/components/inquiries/ProductInquiryForm.tsx": "Customer-facing form to submit inquiries about a product, sending data through a mutation hook.",
  "frontend/src/components/layout/AppLayout.tsx": "App-wide layout with header, navigation, footer, and automatic profile setup prompt.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on user identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useCurrentUser.ts": "Derives authentication state and returns the current user's profile and login status.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing identity loading, login, and status.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating categories, user profiles, entrepreneur profiles, and product data via an actor API.",
  "frontend/src/index.css": "Defines Tailwind base styles and a custom color palette with light and dark mode CSS variables.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/CategoryBrowsePage.tsx": "Displays products within a selected category with loading skeletons and navigation to product pages.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the entrepreneur dashboard with profile management, product management, and inquiry handling tabs.",
  "frontend/src/pages/HomePage.tsx": "Shows the homepage with a hero section and a category grid that links to category browsing pages.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays product details, seller info, and an inquiry form, with loading states and navigation controls.",
  "frontend/src/pages/SellerProfilePage.tsx": "Seller profile page that loads seller info and their products, showing details, contact, and product cards with loading states.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, typography, shadows, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Project state file describing the marketplace app’s goals, features, schema version, and required image assets."
}